{
  "backend/main.mo": "Motoko actor defining a Product type and a Map-based store with methods to add, retrieve, and filter products by category or ID.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (visual theme, homepage, catalog, product detail, navigation) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short descriptions for each frontend source file, serving as a quick reference for the project's frontend structure.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark themes including colors, borders, and chart tokens.",
  "frontend/index.html": "Minimal HTML shell with a root div and a module script tag loading the React app entry point.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for home, catalog, and product detail pages, all nested under a Layout root route.",
  "frontend/src/components/CategoryFilter.tsx": "Renders a row of filter buttons for all product categories plus 'All', with active gold styling and optional per-category product counts.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand identity, explore and category navigation links, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Page layout shell that composes the Navigation header, a TanStack Router Outlet for page content, and the Footer.",
  "frontend/src/components/Navigation.tsx": "Fixed top navigation bar with brand logo, desktop nav links with active state, a 'Request a Quote' button, and a collapsible mobile menu.",
  "frontend/src/components/ProductCard.tsx": "Reusable card component displaying a product image, category badge, name, short description, and a 'View Details' link to the product detail page.",
  "frontend/src/components/ProductSkeleton.tsx": "Loading skeleton placeholder that mirrors the ProductCard layout using Skeleton components for image and text areas.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Computer authentication via AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all products, a single product, products by category, and adding a product via the backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, defines light/dark CSS custom properties for a glass-inspired design system, and adds utility classes for glass cards, gold accents, and hover effects.",
  "frontend/src/lib/seedData.ts": "Defines product category constants, category image mappings, and an array of seed product data (mirrors, windows, doors, etc.) used to pre-populate the catalog.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CatalogPage.tsx": "Catalog page component that displays a filterable, paginated grid of products fetched from the backend, with category filter controls and loading skeletons.",
  "frontend/src/pages/HomePage.tsx": "The main landing page that seeds initial products if none exist, then renders a hero section, features list, and a grid of up to 6 featured products using data from the product query hooks.",
  "frontend/src/pages/ProductDetailPage.tsx": "A product detail page that fetches a single product by ID from the route params and displays its image, category badge, name, descriptions, specifications table, and contact/quote CTAs with loading and error states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Cormorant Garamond, Inter), an extended color palette (gold, cream, warm-gray), custom shadows, border radii, and keyframe animations for the project's design system.",
  "project_state.json": "Project state metadata file tracking schema version, project summary, architectural notes, required image assets, and a list of implemented features for the home glass products showcase website."
}